Schwabano/IMXRT1064-EVK-BuildEnvironment/TargetSpecific/Drivers/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define BOARD_INITPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0x0A04U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */
#define BOARD_INITPINS_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK 0x80000000U /*!< GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: affected bits mask */

/* GPIO_AD_B0_13 (coord L14), UART1_RXD */
/* Routed pin properties */
#define BOARD_UART1_RXD_PERIPHERAL                                       LPUART1   /*!< Peripheral name */
#define BOARD_UART1_RXD_SIGNAL                                                RX   /*!< Signal name */
#define BOARD_UART1_RXD_PIN_NAME                                   GPIO_AD_B0_13   /*!< Routed pin name */
#define BOARD_UART1_RXD_LABEL                                        "UART1_RXD"   /*!< Label */
#define BOARD_UART1_RXD_NAME                                         "UART1_RXD"   /*!< Identifier */

/* GPIO_AD_B0_12 (coord K14), UART1_TXD */
/* Routed pin properties */
#define BOARD_UART1_TXD_PERIPHERAL                                       LPUART1   /*!< Peripheral name */
#define BOARD_UART1_TXD_SIGNAL                                                TX   /*!< Signal name */
#define BOARD_UART1_TXD_PIN_NAME                                   GPIO_AD_B0_12   /*!< Routed pin name */
#define BOARD_UART1_TXD_LABEL                                        "UART1_TXD"   /*!< Label */
#define BOARD_UART1_TXD_NAME                                         "UART1_TXD"   /*!< Identifier */

/* GPIO_AD_B0_11 (coord G10), JTAG_nTRST/J21[3]/INT2_COMBO/LCD_TOUCH_INT/J22[3]/U32[9] */
/* Routed pin properties */
#define BOARD_INT2_COMBO_PERIPHERAL                                        GPIO1   /*!< Peripheral name */
#define BOARD_INT2_COMBO_SIGNAL                                          gpio_io   /*!< Signal name */
#define BOARD_INT2_COMBO_CHANNEL                                             11U   /*!< Signal channel */
#define BOARD_INT2_COMBO_PIN_NAME                                  GPIO_AD_B0_11   /*!< Routed pin name */
#define BOARD_INT2_COMBO_LABEL "JTAG_nTRST/J21[3]/INT2_COMBO/LCD_TOUCH_INT/J22[3]/U32[9]" /*!< Label */
#define BOARD_INT2_COMBO_NAME                                       "INT2_COMBO"   /*!< Identifier */

/* Symbols to be used with GPIO driver */
#define BOARD_INT2_COMBO_GPIO                                              GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INT2_COMBO_GPIO_PIN                                            11U   /*!< GPIO pin number */
#define BOARD_INT2_COMBO_GPIO_PIN_MASK                               (1U << 11U)   /*!< GPIO pin mask */
#define BOARD_INT2_COMBO_PORT                                              GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INT2_COMBO_PIN                                                 11U   /*!< PORT pin number */
#define BOARD_INT2_COMBO_PIN_MASK                                    (1U << 11U)   /*!< PORT pin mask */

/* GPIO_B0_00 (coord D7), LCDIF_CLK */
/* Routed pin properties */
#define BOARD_LCDIF_CLK_PERIPHERAL                                         LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_CLK_SIGNAL                                         lcdif_clk   /*!< Signal name */
#define BOARD_LCDIF_CLK_PIN_NAME                                      GPIO_B0_00   /*!< Routed pin name */
#define BOARD_LCDIF_CLK_LABEL                                        "LCDIF_CLK"   /*!< Label */
#define BOARD_LCDIF_CLK_NAME                                         "LCDIF_CLK"   /*!< Identifier */

/* GPIO_B0_04 (coord C8), LCDIF_D0/BT_CFG[0] */
/* Routed pin properties */
#define BOARD_LCDIF_D0_PERIPHERAL                                          LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D0_SIGNAL                                         lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D0_CHANNEL                                                0U   /*!< Signal channel */
#define BOARD_LCDIF_D0_PIN_NAME                                       GPIO_B0_04   /*!< Routed pin name */
#define BOARD_LCDIF_D0_LABEL                                "LCDIF_D0/BT_CFG[0]"   /*!< Label */
#define BOARD_LCDIF_D0_NAME                                           "LCDIF_D0"   /*!< Identifier */

/* GPIO_B0_05 (coord B8), LCDIF_D1/BT_CFG[1] */
/* Routed pin properties */
#define BOARD_LCDIF_D1_PERIPHERAL                                          LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D1_SIGNAL                                         lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D1_CHANNEL                                                1U   /*!< Signal channel */
#define BOARD_LCDIF_D1_PIN_NAME                                       GPIO_B0_05   /*!< Routed pin name */
#define BOARD_LCDIF_D1_LABEL                                "LCDIF_D1/BT_CFG[1]"   /*!< Label */
#define BOARD_LCDIF_D1_NAME                                           "LCDIF_D1"   /*!< Identifier */

