Schwabano/IMXRT1064-EVK-BuildEnvironment/TargetSpecific/Drivers/pin_mux.h
/* GPIO_B0_06 (coord A8), LCDIF_D2/BT_CFG[2] */
/* Routed pin properties */
#define BOARD_LCDIF_D2_PERIPHERAL                                          LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D2_SIGNAL                                         lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D2_CHANNEL                                                2U   /*!< Signal channel */
#define BOARD_LCDIF_D2_PIN_NAME                                       GPIO_B0_06   /*!< Routed pin name */
#define BOARD_LCDIF_D2_LABEL                                "LCDIF_D2/BT_CFG[2]"   /*!< Label */
#define BOARD_LCDIF_D2_NAME                                           "LCDIF_D2"   /*!< Identifier */

/* GPIO_B0_07 (coord A9), LCDIF_D3/BT_CFG[3] */
/* Routed pin properties */
#define BOARD_LCDIF_D3_PERIPHERAL                                          LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D3_SIGNAL                                         lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D3_CHANNEL                                                3U   /*!< Signal channel */
#define BOARD_LCDIF_D3_PIN_NAME                                       GPIO_B0_07   /*!< Routed pin name */
#define BOARD_LCDIF_D3_LABEL                                "LCDIF_D3/BT_CFG[3]"   /*!< Label */
#define BOARD_LCDIF_D3_NAME                                           "LCDIF_D3"   /*!< Identifier */

/* GPIO_B0_08 (coord B9), LCDIF_D4/BT_CFG[4] */
/* Routed pin properties */
#define BOARD_LCDIF_D4_PERIPHERAL                                          LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D4_SIGNAL                                         lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D4_CHANNEL                                                4U   /*!< Signal channel */
#define BOARD_LCDIF_D4_PIN_NAME                                       GPIO_B0_08   /*!< Routed pin name */
#define BOARD_LCDIF_D4_LABEL                                "LCDIF_D4/BT_CFG[4]"   /*!< Label */
#define BOARD_LCDIF_D4_NAME                                           "LCDIF_D4"   /*!< Identifier */

/* GPIO_B0_09 (coord C9), LCDIF_D5/BT_CFG[5] */
/* Routed pin properties */
#define BOARD_LCDIF_D5_PERIPHERAL                                          LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D5_SIGNAL                                         lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D5_CHANNEL                                                5U   /*!< Signal channel */
#define BOARD_LCDIF_D5_PIN_NAME                                       GPIO_B0_09   /*!< Routed pin name */
#define BOARD_LCDIF_D5_LABEL                                "LCDIF_D5/BT_CFG[5]"   /*!< Label */
#define BOARD_LCDIF_D5_NAME                                           "LCDIF_D5"   /*!< Identifier */

/* GPIO_B0_10 (coord D9), LCDIF_D6/BT_CFG[6] */
/* Routed pin properties */
#define BOARD_LCDIF_D6_PERIPHERAL                                          LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D6_SIGNAL                                         lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D6_CHANNEL                                                6U   /*!< Signal channel */
#define BOARD_LCDIF_D6_PIN_NAME                                       GPIO_B0_10   /*!< Routed pin name */
#define BOARD_LCDIF_D6_LABEL                                "LCDIF_D6/BT_CFG[6]"   /*!< Label */
#define BOARD_LCDIF_D6_NAME                                           "LCDIF_D6"   /*!< Identifier */

/* GPIO_B0_11 (coord A10), LCDIF_D7/BT_CFG[7] */
/* Routed pin properties */
#define BOARD_LCDIF_D7_PERIPHERAL                                          LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D7_SIGNAL                                         lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D7_CHANNEL                                                7U   /*!< Signal channel */
#define BOARD_LCDIF_D7_PIN_NAME                                       GPIO_B0_11   /*!< Routed pin name */
#define BOARD_LCDIF_D7_LABEL                                "LCDIF_D7/BT_CFG[7]"   /*!< Label */
#define BOARD_LCDIF_D7_NAME                                           "LCDIF_D7"   /*!< Identifier */

/* GPIO_B0_12 (coord C10), LCDIF_D8/BT_CFG[8] */
/* Routed pin properties */
#define BOARD_LCDIF_D8_PERIPHERAL                                          LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D8_SIGNAL                                         lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D8_CHANNEL                                                8U   /*!< Signal channel */
#define BOARD_LCDIF_D8_PIN_NAME                                       GPIO_B0_12   /*!< Routed pin name */
#define BOARD_LCDIF_D8_LABEL                                "LCDIF_D8/BT_CFG[8]"   /*!< Label */
#define BOARD_LCDIF_D8_NAME                                           "LCDIF_D8"   /*!< Identifier */

/* GPIO_B0_13 (coord D10), LCDIF_D9/BT_CFG[9] */
/* Routed pin properties */
#define BOARD_LCDIF_D9_PERIPHERAL                                          LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D9_SIGNAL                                         lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D9_CHANNEL                                                9U   /*!< Signal channel */
#define BOARD_LCDIF_D9_PIN_NAME                                       GPIO_B0_13   /*!< Routed pin name */
#define BOARD_LCDIF_D9_LABEL                                "LCDIF_D9/BT_CFG[9]"   /*!< Label */
#define BOARD_LCDIF_D9_NAME                                           "LCDIF_D9"   /*!< Identifier */

/* GPIO_B0_14 (coord E10), LCDIF_D10/BT_CFG[10] */
/* Routed pin properties */
#define BOARD_LCDIF_D10_PERIPHERAL                                         LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D10_SIGNAL                                        lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D10_CHANNEL                                              10U   /*!< Signal channel */
#define BOARD_LCDIF_D10_PIN_NAME                                      GPIO_B0_14   /*!< Routed pin name */
#define BOARD_LCDIF_D10_LABEL                             "LCDIF_D10/BT_CFG[10]"   /*!< Label */
#define BOARD_LCDIF_D10_NAME                                         "LCDIF_D10"   /*!< Identifier */

/* GPIO_B0_15 (coord E11), LCDIF_D11/BT_CFG[11] */
/* Routed pin properties */
#define BOARD_LCDIF_D11_PERIPHERAL                                         LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D11_SIGNAL                                        lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D11_CHANNEL                                              11U   /*!< Signal channel */
#define BOARD_LCDIF_D11_PIN_NAME                                      GPIO_B0_15   /*!< Routed pin name */
#define BOARD_LCDIF_D11_LABEL                             "LCDIF_D11/BT_CFG[11]"   /*!< Label */
#define BOARD_LCDIF_D11_NAME                                         "LCDIF_D11"   /*!< Identifier */

/* GPIO_B1_00 (coord A11), LCDIF_D12 */
/* Routed pin properties */
#define BOARD_LCDIF_D12_PERIPHERAL                                         LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D12_SIGNAL                                        lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D12_CHANNEL                                              12U   /*!< Signal channel */
#define BOARD_LCDIF_D12_PIN_NAME                                      GPIO_B1_00   /*!< Routed pin name */
#define BOARD_LCDIF_D12_LABEL                                        "LCDIF_D12"   /*!< Label */
#define BOARD_LCDIF_D12_NAME                                         "LCDIF_D12"   /*!< Identifier */

