Schwabano/IMXRT1064-EVK-BuildEnvironment/TargetSpecific/Drivers/pin_mux.h
/* GPIO_B1_01 (coord B11), LCDIF_D13 */
/* Routed pin properties */
#define BOARD_LCDIF_D13_PERIPHERAL                                         LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D13_SIGNAL                                        lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D13_CHANNEL                                              13U   /*!< Signal channel */
#define BOARD_LCDIF_D13_PIN_NAME                                      GPIO_B1_01   /*!< Routed pin name */
#define BOARD_LCDIF_D13_LABEL                                        "LCDIF_D13"   /*!< Label */
#define BOARD_LCDIF_D13_NAME                                         "LCDIF_D13"   /*!< Identifier */

/* GPIO_B1_02 (coord C11), LCDIF_D14 */
/* Routed pin properties */
#define BOARD_LCDIF_D14_PERIPHERAL                                         LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D14_SIGNAL                                        lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D14_CHANNEL                                              14U   /*!< Signal channel */
#define BOARD_LCDIF_D14_PIN_NAME                                      GPIO_B1_02   /*!< Routed pin name */
#define BOARD_LCDIF_D14_LABEL                                        "LCDIF_D14"   /*!< Label */
#define BOARD_LCDIF_D14_NAME                                         "LCDIF_D14"   /*!< Identifier */

/* GPIO_B1_03 (coord D11), LCDIF_D15 */
/* Routed pin properties */
#define BOARD_LCDIF_D15_PERIPHERAL                                         LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D15_SIGNAL                                        lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D15_CHANNEL                                              15U   /*!< Signal channel */
#define BOARD_LCDIF_D15_PIN_NAME                                      GPIO_B1_03   /*!< Routed pin name */
#define BOARD_LCDIF_D15_LABEL                                        "LCDIF_D15"   /*!< Label */
#define BOARD_LCDIF_D15_NAME                                         "LCDIF_D15"   /*!< Identifier */

/* GPIO_B0_01 (coord E7), LCDIF_ENABLE */
/* Routed pin properties */
#define BOARD_LCDIF_ENABLE_PERIPHERAL                                      LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_ENABLE_SIGNAL                                   lcdif_enable   /*!< Signal name */
#define BOARD_LCDIF_ENABLE_PIN_NAME                                   GPIO_B0_01   /*!< Routed pin name */
#define BOARD_LCDIF_ENABLE_LABEL                                  "LCDIF_ENABLE"   /*!< Label */
#define BOARD_LCDIF_ENABLE_NAME                                   "LCDIF_ENABLE"   /*!< Identifier */

/* GPIO_B0_02 (coord E8), LCDIF_HSYNC */
/* Routed pin properties */
#define BOARD_LCDIF_HSYNC_PERIPHERAL                                       LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_HSYNC_SIGNAL                                     lcdif_hsync   /*!< Signal name */
#define BOARD_LCDIF_HSYNC_PIN_NAME                                    GPIO_B0_02   /*!< Routed pin name */
#define BOARD_LCDIF_HSYNC_LABEL                                    "LCDIF_HSYNC"   /*!< Label */
#define BOARD_LCDIF_HSYNC_NAME                                     "LCDIF_HSYNC"   /*!< Identifier */

/* GPIO_B0_03 (coord D8), LCDIF_VSYNC */
/* Routed pin properties */
#define BOARD_LCDIF_VSYNC_PERIPHERAL                                       LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_VSYNC_SIGNAL                                     lcdif_vsync   /*!< Signal name */
#define BOARD_LCDIF_VSYNC_PIN_NAME                                    GPIO_B0_03   /*!< Routed pin name */
#define BOARD_LCDIF_VSYNC_LABEL                                    "LCDIF_VSYNC"   /*!< Label */
#define BOARD_LCDIF_VSYNC_NAME                                     "LCDIF_VSYNC"   /*!< Identifier */

/* GPIO_B1_15 (coord B14), USB_HOST_PWR/BACKLIGHT_CTL */
/* Routed pin properties */
#define BOARD_BACKLIGHT_CTL_PERIPHERAL                                     GPIO2   /*!< Peripheral name */
#define BOARD_BACKLIGHT_CTL_SIGNAL                                       gpio_io   /*!< Signal name */
#define BOARD_BACKLIGHT_CTL_CHANNEL                                          31U   /*!< Signal channel */
#define BOARD_BACKLIGHT_CTL_PIN_NAME                                  GPIO_B1_15   /*!< Routed pin name */
#define BOARD_BACKLIGHT_CTL_LABEL                   "USB_HOST_PWR/BACKLIGHT_CTL"   /*!< Label */
#define BOARD_BACKLIGHT_CTL_NAME                                 "BACKLIGHT_CTL"   /*!< Identifier */

/* Symbols to be used with GPIO driver */
#define BOARD_BACKLIGHT_CTL_GPIO                                           GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_BACKLIGHT_CTL_GPIO_PIN                                         31U   /*!< GPIO pin number */
#define BOARD_BACKLIGHT_CTL_GPIO_PIN_MASK                            (1U << 31U)   /*!< GPIO pin mask */
#define BOARD_BACKLIGHT_CTL_PORT                                           GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_BACKLIGHT_CTL_PIN                                              31U   /*!< PORT pin number */
#define BOARD_BACKLIGHT_CTL_PIN_MASK                                 (1U << 31U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_EMC_09 (coord C2), SEMC_A0 */
/* Routed pin properties */
#define BOARD_SEMC_A0_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A0_SIGNAL                                                ADDR   /*!< Signal name */
#define BOARD_SEMC_A0_CHANNEL                                                 0U   /*!< Signal channel */
#define BOARD_SEMC_A0_PIN_NAME                                       GPIO_EMC_09   /*!< Routed pin name */
#define BOARD_SEMC_A0_LABEL                                            "SEMC_A0"   /*!< Label */
#define BOARD_SEMC_A0_NAME                                             "SEMC_A0"   /*!< Identifier */

/* GPIO_EMC_10 (coord G1), SEMC_A1 */
/* Routed pin properties */
#define BOARD_SEMC_A1_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A1_SIGNAL                                                ADDR   /*!< Signal name */
#define BOARD_SEMC_A1_CHANNEL                                                 1U   /*!< Signal channel */
#define BOARD_SEMC_A1_PIN_NAME                                       GPIO_EMC_10   /*!< Routed pin name */
#define BOARD_SEMC_A1_LABEL                                            "SEMC_A1"   /*!< Label */
#define BOARD_SEMC_A1_NAME                                             "SEMC_A1"   /*!< Identifier */

/* GPIO_EMC_11 (coord G3), SEMC_A2 */
/* Routed pin properties */
#define BOARD_SEMC_A2_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A2_SIGNAL                                                ADDR   /*!< Signal name */
#define BOARD_SEMC_A2_CHANNEL                                                 2U   /*!< Signal channel */
#define BOARD_SEMC_A2_PIN_NAME                                       GPIO_EMC_11   /*!< Routed pin name */
#define BOARD_SEMC_A2_LABEL                                            "SEMC_A2"   /*!< Label */
#define BOARD_SEMC_A2_NAME                                             "SEMC_A2"   /*!< Identifier */

/* GPIO_EMC_12 (coord H1), SEMC_A3 */
/* Routed pin properties */
#define BOARD_SEMC_A3_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A3_SIGNAL                                                ADDR   /*!< Signal name */
#define BOARD_SEMC_A3_CHANNEL                                                 3U   /*!< Signal channel */
#define BOARD_SEMC_A3_PIN_NAME                                       GPIO_EMC_12   /*!< Routed pin name */
#define BOARD_SEMC_A3_LABEL                                            "SEMC_A3"   /*!< Label */
#define BOARD_SEMC_A3_NAME                                             "SEMC_A3"   /*!< Identifier */

/* GPIO_EMC_13 (coord A6), SEMC_A4 */
/* Routed pin properties */
#define BOARD_SEMC_A4_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A4_SIGNAL                                                ADDR   /*!< Signal name */
#define BOARD_SEMC_A4_CHANNEL                                                 4U   /*!< Signal channel */
#define BOARD_SEMC_A4_PIN_NAME                                       GPIO_EMC_13   /*!< Routed pin name */
#define BOARD_SEMC_A4_LABEL                                            "SEMC_A4"   /*!< Label */
#define BOARD_SEMC_A4_NAME                                             "SEMC_A4"   /*!< Identifier */

/* GPIO_EMC_14 (coord B6), SEMC_A5 */
/* Routed pin properties */
#define BOARD_SEMC_A5_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A5_SIGNAL                                                ADDR   /*!< Signal name */
#define BOARD_SEMC_A5_CHANNEL                                                 5U   /*!< Signal channel */
#define BOARD_SEMC_A5_PIN_NAME                                       GPIO_EMC_14   /*!< Routed pin name */
#define BOARD_SEMC_A5_LABEL                                            "SEMC_A5"   /*!< Label */
#define BOARD_SEMC_A5_NAME                                             "SEMC_A5"   /*!< Identifier */

