Schwabano/IMXRT1064-EVK-BuildEnvironment/TargetSpecific/Drivers/pin_mux.h
/* GPIO_EMC_15 (coord B1), SEMC_A6 */
/* Routed pin properties */
#define BOARD_SEMC_A6_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A6_SIGNAL                                                ADDR   /*!< Signal name */
#define BOARD_SEMC_A6_CHANNEL                                                 6U   /*!< Signal channel */
#define BOARD_SEMC_A6_PIN_NAME                                       GPIO_EMC_15   /*!< Routed pin name */
#define BOARD_SEMC_A6_LABEL                                            "SEMC_A6"   /*!< Label */
#define BOARD_SEMC_A6_NAME                                             "SEMC_A6"   /*!< Identifier */

/* GPIO_EMC_16 (coord A5), SEMC_A7 */
/* Routed pin properties */
#define BOARD_SEMC_A7_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A7_SIGNAL                                                ADDR   /*!< Signal name */
#define BOARD_SEMC_A7_CHANNEL                                                 7U   /*!< Signal channel */
#define BOARD_SEMC_A7_PIN_NAME                                       GPIO_EMC_16   /*!< Routed pin name */
#define BOARD_SEMC_A7_LABEL                                            "SEMC_A7"   /*!< Label */
#define BOARD_SEMC_A7_NAME                                             "SEMC_A7"   /*!< Identifier */

/* GPIO_EMC_17 (coord A4), SEMC_A8 */
/* Routed pin properties */
#define BOARD_SEMC_A8_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A8_SIGNAL                                                ADDR   /*!< Signal name */
#define BOARD_SEMC_A8_CHANNEL                                                 8U   /*!< Signal channel */
#define BOARD_SEMC_A8_PIN_NAME                                       GPIO_EMC_17   /*!< Routed pin name */
#define BOARD_SEMC_A8_LABEL                                            "SEMC_A8"   /*!< Label */
#define BOARD_SEMC_A8_NAME                                             "SEMC_A8"   /*!< Identifier */

/* GPIO_EMC_18 (coord B2), SEMC_A9 */
/* Routed pin properties */
#define BOARD_SEMC_A9_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A9_SIGNAL                                                ADDR   /*!< Signal name */
#define BOARD_SEMC_A9_CHANNEL                                                 9U   /*!< Signal channel */
#define BOARD_SEMC_A9_PIN_NAME                                       GPIO_EMC_18   /*!< Routed pin name */
#define BOARD_SEMC_A9_LABEL                                            "SEMC_A9"   /*!< Label */
#define BOARD_SEMC_A9_NAME                                             "SEMC_A9"   /*!< Identifier */

/* GPIO_EMC_23 (coord G2), SEMC_A10 */
/* Routed pin properties */
#define BOARD_SEMC_A10_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A10_SIGNAL                                               ADDR   /*!< Signal name */
#define BOARD_SEMC_A10_CHANNEL                                               10U   /*!< Signal channel */
#define BOARD_SEMC_A10_PIN_NAME                                      GPIO_EMC_23   /*!< Routed pin name */
#define BOARD_SEMC_A10_LABEL                                          "SEMC_A10"   /*!< Label */
#define BOARD_SEMC_A10_NAME                                           "SEMC_A10"   /*!< Identifier */

/* GPIO_EMC_19 (coord B4), SEMC_A11 */
/* Routed pin properties */
#define BOARD_SEMC_A11_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A11_SIGNAL                                               ADDR   /*!< Signal name */
#define BOARD_SEMC_A11_CHANNEL                                               11U   /*!< Signal channel */
#define BOARD_SEMC_A11_PIN_NAME                                      GPIO_EMC_19   /*!< Routed pin name */
#define BOARD_SEMC_A11_LABEL                                          "SEMC_A11"   /*!< Label */
#define BOARD_SEMC_A11_NAME                                           "SEMC_A11"   /*!< Identifier */

/* GPIO_EMC_20 (coord A3), SEMC_A12 */
/* Routed pin properties */
#define BOARD_SEMC_A12_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A12_SIGNAL                                               ADDR   /*!< Signal name */
#define BOARD_SEMC_A12_CHANNEL                                               12U   /*!< Signal channel */
#define BOARD_SEMC_A12_PIN_NAME                                      GPIO_EMC_20   /*!< Routed pin name */
#define BOARD_SEMC_A12_LABEL                                          "SEMC_A12"   /*!< Label */
#define BOARD_SEMC_A12_NAME                                           "SEMC_A12"   /*!< Identifier */

/* GPIO_EMC_21 (coord C1), SEMC_BA0 */
/* Routed pin properties */
#define BOARD_SEMC_BA0_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_BA0_SIGNAL                                                 BA   /*!< Signal name */
#define BOARD_SEMC_BA0_CHANNEL                                                0U   /*!< Signal channel */
#define BOARD_SEMC_BA0_PIN_NAME                                      GPIO_EMC_21   /*!< Routed pin name */
#define BOARD_SEMC_BA0_LABEL                                          "SEMC_BA0"   /*!< Label */
#define BOARD_SEMC_BA0_NAME                                           "SEMC_BA0"   /*!< Identifier */

/* GPIO_EMC_22 (coord F1), SEMC_BA1 */
/* Routed pin properties */
#define BOARD_SEMC_BA1_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_BA1_SIGNAL                                                 BA   /*!< Signal name */
#define BOARD_SEMC_BA1_CHANNEL                                                1U   /*!< Signal channel */
#define BOARD_SEMC_BA1_PIN_NAME                                      GPIO_EMC_22   /*!< Routed pin name */
#define BOARD_SEMC_BA1_LABEL                                          "SEMC_BA1"   /*!< Label */
#define BOARD_SEMC_BA1_NAME                                           "SEMC_BA1"   /*!< Identifier */

