Schwabano/IMXRT1064-EVK-BuildEnvironment/TargetSpecific/Drivers/pin_mux.h
/* GPIO_EMC_24 (coord D3), SEMC_CAS */
/* Routed pin properties */
#define BOARD_SEMC_CAS_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_CAS_SIGNAL                                           semc_cas   /*!< Signal name */
#define BOARD_SEMC_CAS_PIN_NAME                                      GPIO_EMC_24   /*!< Routed pin name */
#define BOARD_SEMC_CAS_LABEL                                          "SEMC_CAS"   /*!< Label */
#define BOARD_SEMC_CAS_NAME                                           "SEMC_CAS"   /*!< Identifier */

/* GPIO_EMC_27 (coord A2), SEMC_CKE */
/* Routed pin properties */
#define BOARD_SEMC_CKE_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_CKE_SIGNAL                                           semc_cke   /*!< Signal name */
#define BOARD_SEMC_CKE_PIN_NAME                                      GPIO_EMC_27   /*!< Routed pin name */
#define BOARD_SEMC_CKE_LABEL                                          "SEMC_CKE"   /*!< Label */
#define BOARD_SEMC_CKE_NAME                                           "SEMC_CKE"   /*!< Identifier */

/* GPIO_EMC_26 (coord B3), SEMC_CLK */
/* Routed pin properties */
#define BOARD_SEMC_CLK_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_CLK_SIGNAL                                           semc_clk   /*!< Signal name */
#define BOARD_SEMC_CLK_PIN_NAME                                      GPIO_EMC_26   /*!< Routed pin name */
#define BOARD_SEMC_CLK_LABEL                                          "SEMC_CLK"   /*!< Label */
#define BOARD_SEMC_CLK_NAME                                           "SEMC_CLK"   /*!< Identifier */

/* GPIO_EMC_29 (coord E1), SEMC_CS0 */
/* Routed pin properties */
#define BOARD_SEMC_CS0_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_CS0_SIGNAL                                                 CS   /*!< Signal name */
#define BOARD_SEMC_CS0_CHANNEL                                                0U   /*!< Signal channel */
#define BOARD_SEMC_CS0_PIN_NAME                                      GPIO_EMC_29   /*!< Routed pin name */
#define BOARD_SEMC_CS0_LABEL                                          "SEMC_CS0"   /*!< Label */
#define BOARD_SEMC_CS0_NAME                                           "SEMC_CS0"   /*!< Identifier */

/* GPIO_EMC_00 (coord E3), SEMC_D0 */
/* Routed pin properties */
#define BOARD_SEMC_D0_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_D0_SIGNAL                                                DATA   /*!< Signal name */
#define BOARD_SEMC_D0_CHANNEL                                                 0U   /*!< Signal channel */
#define BOARD_SEMC_D0_PIN_NAME                                       GPIO_EMC_00   /*!< Routed pin name */
#define BOARD_SEMC_D0_LABEL                                            "SEMC_D0"   /*!< Label */
#define BOARD_SEMC_D0_NAME                                             "SEMC_D0"   /*!< Identifier */

/* GPIO_EMC_01 (coord F3), SEMC_D1 */
/* Routed pin properties */
#define BOARD_SEMC_D1_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_D1_SIGNAL                                                DATA   /*!< Signal name */
#define BOARD_SEMC_D1_CHANNEL                                                 1U   /*!< Signal channel */
#define BOARD_SEMC_D1_PIN_NAME                                       GPIO_EMC_01   /*!< Routed pin name */
#define BOARD_SEMC_D1_LABEL                                            "SEMC_D1"   /*!< Label */
#define BOARD_SEMC_D1_NAME                                             "SEMC_D1"   /*!< Identifier */

/* GPIO_EMC_02 (coord F4), SEMC_D2 */
/* Routed pin properties */
#define BOARD_SEMC_D2_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_D2_SIGNAL                                                DATA   /*!< Signal name */
#define BOARD_SEMC_D2_CHANNEL                                                 2U   /*!< Signal channel */
#define BOARD_SEMC_D2_PIN_NAME                                       GPIO_EMC_02   /*!< Routed pin name */
#define BOARD_SEMC_D2_LABEL                                            "SEMC_D2"   /*!< Label */
#define BOARD_SEMC_D2_NAME                                             "SEMC_D2"   /*!< Identifier */

/* GPIO_EMC_03 (coord G4), SEMC_D3 */
/* Routed pin properties */
#define BOARD_SEMC_D3_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_D3_SIGNAL                                                DATA   /*!< Signal name */
#define BOARD_SEMC_D3_CHANNEL                                                 3U   /*!< Signal channel */
#define BOARD_SEMC_D3_PIN_NAME                                       GPIO_EMC_03   /*!< Routed pin name */
#define BOARD_SEMC_D3_LABEL                                            "SEMC_D3"   /*!< Label */
#define BOARD_SEMC_D3_NAME                                             "SEMC_D3"   /*!< Identifier */

/* GPIO_EMC_04 (coord F2), SEMC_D4 */
/* Routed pin properties */
#define BOARD_SEMC_D4_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_D4_SIGNAL                                                DATA   /*!< Signal name */
#define BOARD_SEMC_D4_CHANNEL                                                 4U   /*!< Signal channel */
#define BOARD_SEMC_D4_PIN_NAME                                       GPIO_EMC_04   /*!< Routed pin name */
#define BOARD_SEMC_D4_LABEL                                            "SEMC_D4"   /*!< Label */
#define BOARD_SEMC_D4_NAME                                             "SEMC_D4"   /*!< Identifier */

/* GPIO_EMC_05 (coord G5), SEMC_D5 */
/* Routed pin properties */
#define BOARD_SEMC_D5_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_D5_SIGNAL                                                DATA   /*!< Signal name */
#define BOARD_SEMC_D5_CHANNEL                                                 5U   /*!< Signal channel */
#define BOARD_SEMC_D5_PIN_NAME                                       GPIO_EMC_05   /*!< Routed pin name */
#define BOARD_SEMC_D5_LABEL                                            "SEMC_D5"   /*!< Label */
#define BOARD_SEMC_D5_NAME                                             "SEMC_D5"   /*!< Identifier */

/* GPIO_EMC_06 (coord H5), SEMC_D6 */
/* Routed pin properties */
#define BOARD_SEMC_D6_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_D6_SIGNAL                                                DATA   /*!< Signal name */
#define BOARD_SEMC_D6_CHANNEL                                                 6U   /*!< Signal channel */
#define BOARD_SEMC_D6_PIN_NAME                                       GPIO_EMC_06   /*!< Routed pin name */
#define BOARD_SEMC_D6_LABEL                                            "SEMC_D6"   /*!< Label */
#define BOARD_SEMC_D6_NAME                                             "SEMC_D6"   /*!< Identifier */

/* GPIO_EMC_07 (coord H4), SEMC_D7 */
/* Routed pin properties */
#define BOARD_SEMC_D7_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_D7_SIGNAL                                                DATA   /*!< Signal name */
#define BOARD_SEMC_D7_CHANNEL                                                 7U   /*!< Signal channel */
#define BOARD_SEMC_D7_PIN_NAME                                       GPIO_EMC_07   /*!< Routed pin name */
#define BOARD_SEMC_D7_LABEL                                            "SEMC_D7"   /*!< Label */
#define BOARD_SEMC_D7_NAME                                             "SEMC_D7"   /*!< Identifier */

/* GPIO_EMC_30 (coord C6), SEMC_D8 */
/* Routed pin properties */
#define BOARD_SEMC_D8_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_D8_SIGNAL                                                DATA   /*!< Signal name */
#define BOARD_SEMC_D8_CHANNEL                                                 8U   /*!< Signal channel */
#define BOARD_SEMC_D8_PIN_NAME                                       GPIO_EMC_30   /*!< Routed pin name */
#define BOARD_SEMC_D8_LABEL                                            "SEMC_D8"   /*!< Label */
#define BOARD_SEMC_D8_NAME                                             "SEMC_D8"   /*!< Identifier */

/* GPIO_EMC_31 (coord C5), SEMC_D9 */
/* Routed pin properties */
#define BOARD_SEMC_D9_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_D9_SIGNAL                                                DATA   /*!< Signal name */
#define BOARD_SEMC_D9_CHANNEL                                                 9U   /*!< Signal channel */
#define BOARD_SEMC_D9_PIN_NAME                                       GPIO_EMC_31   /*!< Routed pin name */
#define BOARD_SEMC_D9_LABEL                                            "SEMC_D9"   /*!< Label */
#define BOARD_SEMC_D9_NAME                                             "SEMC_D9"   /*!< Identifier */

/* GPIO_EMC_32 (coord D5), SEMC_D10 */
/* Routed pin properties */
#define BOARD_SEMC_D10_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_D10_SIGNAL                                               DATA   /*!< Signal name */
#define BOARD_SEMC_D10_CHANNEL                                               10U   /*!< Signal channel */
#define BOARD_SEMC_D10_PIN_NAME                                      GPIO_EMC_32   /*!< Routed pin name */
#define BOARD_SEMC_D10_LABEL                                          "SEMC_D10"   /*!< Label */
#define BOARD_SEMC_D10_NAME                                           "SEMC_D10"   /*!< Identifier */

/* GPIO_EMC_33 (coord C4), SEMC_D11 */
/* Routed pin properties */
#define BOARD_SEMC_D11_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_D11_SIGNAL                                               DATA   /*!< Signal name */
#define BOARD_SEMC_D11_CHANNEL                                               11U   /*!< Signal channel */
#define BOARD_SEMC_D11_PIN_NAME                                      GPIO_EMC_33   /*!< Routed pin name */
#define BOARD_SEMC_D11_LABEL                                          "SEMC_D11"   /*!< Label */
#define BOARD_SEMC_D11_NAME                                           "SEMC_D11"   /*!< Identifier */

